https://www.youtube.com/watch?v=XaCSdr7pPmY&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y&index=20

# When should I use the "inplace" parameter in pandas?

##Always check with shift+tab if 'inplace' default it is false! Otherwise the changes will be permanentelly

In [51]:
import pandas as pd

In [52]:
# read a dataset of UFO reports into a DataFrame
ufo = pd.read_csv('http://bit.ly/uforeports')

In [53]:
ufo.shape

(18241, 5)

In [54]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [55]:
#Just for visualization
ufo.drop

<bound method DataFrame.drop of                        City Colors Reported Shape Reported State  \
0                    Ithaca             NaN       TRIANGLE    NY
1               Willingboro             NaN          OTHER    NJ
2                   Holyoke             NaN           OVAL    CO
3                   Abilene             NaN           DISK    KS
4      New York Worlds Fair             NaN          LIGHT    NY
5               Valley City             NaN           DISK    ND
6               Crater Lake             NaN         CIRCLE    CA
7                      Alma             NaN           DISK    MI
8                   Eklutna             NaN          CIGAR    AK
9                   Hubbard             NaN       CYLINDER    OR
10                  Fontana             NaN          LIGHT    CA
11                 Waterloo             NaN       FIREBALL    AL
12                   Belton             RED         SPHERE    SC
13                   Keokuk             NaN           OVAL    IA
14                Ludington             NaN           DISK    MI
15              Forest Home             NaN         CIRCLE    CA
16              Los Angeles             NaN            NaN    CA
17                Hapeville             NaN            NaN    GA
18                   Oneida             NaN      RECTANGLE    TN
19               Bering Sea             RED          OTHER    AK
20                 Nebraska             NaN           DISK    NE
21                      NaN             NaN            NaN    LA
22                      NaN             NaN          LIGHT    LA
23                Owensboro             NaN      RECTANGLE    KY
24               Wilderness             NaN           DISK    WV
25                San Diego             NaN          CIGAR    CA
26               Wilderness             NaN           DISK    WV
27                   Clovis             NaN           DISK    NM
28               Los Alamos             NaN           DISK    NM
29             Ft. Duschene             NaN           DISK    UT
...                     ...             ...            ...   ...
18211               Holyoke             NaN        DIAMOND    MA
18212                Carson             NaN           DISK    CA
18213              Pasadena           GREEN       FIREBALL    CA
18214                Austin             NaN      FORMATION    TX
18215              El Campo             NaN          OTHER    TX
18216          Garden Grove          ORANGE          LIGHT    CA
18217         Berthoud Pass             NaN       TRIANGLE    CO
18218            Sisterdale             NaN        DIAMOND    TX
18219          Garden Grove             NaN        CHEVRON    CA
18220           Shasta Lake            BLUE           DISK    CA
18221              Franklin             NaN           DISK    NH
18222        Albrightsville             NaN          OTHER    PA
18223            Greenville             NaN            NaN    SC
18224               Eufaula             NaN           DISK    OK
18225           Simi Valley             NaN      FORMATION    CA
18226         San Francisco             NaN      FORMATION    CA
18227         San Francisco             NaN       TRIANGLE    CA
18228            Kingsville             NaN          LIGHT    TX
18229               Chicago             NaN           DISK    IL
18230           Pismo Beach             NaN           OVAL    CA
18231           Pismo Beach             NaN           OVAL    CA
18232                  Lodi             NaN            NaN    WI
18233             Anchorage             RED        VARIOUS    AK
18234              Capitola             NaN       TRIANGLE    CA
18235        Fountain Hills             NaN            NaN    AZ
18236            Grant Park             NaN       TRIANGLE    IL
18237           Spirit Lake             NaN           DISK    IA
18238           Eagle River             NaN            NaN    WI
18239           Eagle River             RED          LIGHT    WI
18240                  Ybor             NaN           OVAL    FL

                   Time
0        6/1/1930 22:00
1       6/30/1930 20:00
2       2/15/1931 14:00
3        6/1/1931 13:00
4       4/18/1933 19:00
5       9/15/1934 15:30
6        6/15/1935 0:00
7        7/15/1936 0:00
8      10/15/1936 17:00
9        6/15/1937 0:00
10      8/15/1937 21:00
11       6/1/1939 20:00
12      6/30/1939 20:00
13        7/7/1939 2:00
14       6/1/1941 13:00
15       7/2/1941 11:30
16       2/25/1942 0:00
17       6/1/1942 22:30
18       7/15/1942 1:00
19      4/30/1943 23:00
20       6/1/1943 15:00
21       8/15/1943 0:00
22       8/15/1943 0:00
23     10/15/1943 11:00
24       1/1/1944 10:00
25       1/1/1944 12:00
26       1/1/1944 12:00
27       4/2/1944 11:00
28       6/1/1944 12:00
29      6/30/1944 10:00
...                 ...
18211  12/28/2000 18:00
18212  12/28/2000 18:20
18213  12/28/2000 19:10
18214   12/29/2000 0:00
18215   12/29/2000 9:00
18216  12/29/2000 16:10
18217  12/29/2000 19:30
18218  12/29/2000 20:00
18219  12/29/2000 20:30
18220  12/29/2000 20:30
18221  12/29/2000 20:50
18222  12/29/2000 21:00
18223  12/29/2000 22:00
18224  12/29/2000 23:30
18225  12/30/2000 10:00
18226  12/30/2000 22:00
18227  12/30/2000 22:00
18228   12/31/2000 4:00
18229  12/31/2000 11:45
18230  12/31/2000 20:00
18231  12/31/2000 20:00
18232  12/31/2000 20:30
18233  12/31/2000 21:00
18234  12/31/2000 22:00
18235  12/31/2000 23:00
18236  12/31/2000 23:00
18237  12/31/2000 23:00
18238  12/31/2000 23:45
18239  12/31/2000 23:45
18240  12/31/2000 23:59

[18241 rows x 5 columns]>

In [56]:
# remove the 'City' column (doesn't affect the DataFrame since inplace=False)
ufo.drop('City',axis=1).head(3)

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00

In [57]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [58]:
# When use inplace, nothing immediatally happen, which means something change!
# shift tab shows inplace is false by default
# remove the 'City' column (does affect the DataFrame since inplace=True)
ufo.drop('City',axis=1, inplace = True)

In [11]:
#Just use inplace when have certainly from the changes you wanna implement

In [68]:
ufo.head()

                                 City Colors Reported Shape Reported State
Time
6/1/1930 22:00                 Ithaca             NaN       TRIANGLE    NY
6/30/1930 20:00           Willingboro             NaN          OTHER    NJ
2/15/1931 14:00               Holyoke             NaN           OVAL    CO
6/1/1931 13:00                Abilene             NaN           DISK    KS
4/18/1933 19:00  New York Worlds Fair             NaN          LIGHT    NY

In [13]:
#dropna = reduce all data with NA
#.shape show how many are reduce form data

In [69]:
# drop a row if any value is missing from that row (doesn't affect the DataFrame since inplace=False)
ufo.dropna(how = 'any').shape

(2486, 4)

In [77]:
# confirm that no rows were actually removed
ufo.shape

(18241, 4)

In [16]:
#Make changes for visualization, however don't change the DataFrame

In [79]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [80]:
# use an assignment statement instead of the 'inplace' parameter
ufo = ufo.set_index('Time')
ufo.tail()

                         City Colors Reported Shape Reported State
Time
12/31/2000 23:00   Grant Park             NaN       TRIANGLE    IL
12/31/2000 23:00  Spirit Lake             NaN           DISK    IA
12/31/2000 23:45  Eagle River             NaN            NaN    WI
12/31/2000 23:45  Eagle River             RED          LIGHT    WI
12/31/2000 23:59         Ybor             NaN           OVAL    FL

In [18]:
#Option1 - may be more efficient

In [83]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [84]:
ufo.set_index('Time', inplace = True)

In [20]:
#Option2

In [86]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [87]:
ufo = ufo.set_index('Time')

In [88]:
ufo.tail()

                         City Colors Reported Shape Reported State
Time
12/31/2000 23:00   Grant Park             NaN       TRIANGLE    IL
12/31/2000 23:00  Spirit Lake             NaN           DISK    IA
12/31/2000 23:45  Eagle River             NaN            NaN    WI
12/31/2000 23:45  Eagle River             RED          LIGHT    WI
12/31/2000 23:59         Ybor             NaN           OVAL    FL

In [ ]:
#Fill missing values

In [89]:
# compare with "forward fill" strategy (doesn't affect the DataFrame since inplace=False)
ufo.fillna(method = 'ffill').tail()

                         City Colors Reported Shape Reported State
Time
12/31/2000 23:00   Grant Park             RED       TRIANGLE    IL
12/31/2000 23:00  Spirit Lake             RED           DISK    IA
12/31/2000 23:45  Eagle River             RED           DISK    WI
12/31/2000 23:45  Eagle River             RED          LIGHT    WI
12/31/2000 23:59         Ybor             RED           OVAL    FL

In [50]:
# fill missing values using "backward fill" strategy (doesn't affect the DataFrame since inplace=False)
ufo.fillna(method = 'bfill').tail()

                 Colors Reported Shape Reported State
Time
12/31/2000 23:00             RED       TRIANGLE    IL
12/31/2000 23:00             RED           DISK    IA
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             NaN           OVAL    FL